{
  "backend/main.mo": "Main canister logic handling authorization, user profiles, and CRUD operations for accounts, categories, transactions, and budgets.",
  "backend/migration.mo": "Migration module upgrading legacy state to include empty budgets and a new budget ID counter.",
  "feature_evidence.json": "Feature evidence report mapping frontend files to implemented budget-related features with metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Global Tailwind CSS setup defining light/dark theme variables and base styling.",
  "frontend/index.html": "HTML entry point loading the React app and main TypeScript bundle.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router, authentication gating, theming, and route definitions including budgets.",
  "frontend/src/components/auth/AuthGate.tsx": "Wrapper that loads the user profile, shows the setup dialog when needed, and gates app rendering during loading.",
  "frontend/src/components/auth/LoginScreen.tsx": "Login page using Internet Identity with UI for sign‑in, loading state, and error display.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal for collecting and saving the user’s display name during first‑time setup.",
  "frontend/src/components/dashboard/CategoryBreakdownChart.tsx": "Computes expense totals per category and renders a bar-style breakdown chart with percentages.",
  "frontend/src/components/dashboard/QuickStats.tsx": "Calculates income, expenses, and net amount and displays them as three stat cards.",
  "frontend/src/components/dashboard/TopCategories.tsx": "Determines the top five expense categories and shows their totals and percentage of overall spending.",
  "frontend/src/components/layout/AppShell.tsx": "Provides the main app layout with navigation, header, user menu, and routing-aware active states.",
  "frontend/src/components/transactions/TransactionFormDialog.tsx": "Modal form for creating a transaction with validation and integration with account and category data.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on the current identity and refreshes dependent queries.",
  "frontend/src/hooks/useFinanceQueries.ts": "Collection of React Query hooks for fetching and mutating accounts, categories, transactions, budgets, and user profiles via the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements a React context and provider for Internet Identity, handling login, identity loading, and auth-client setup.",
  "frontend/src/index.css": "Defines Tailwind layers and CSS variables for light and dark themes, applying global styling.",
  "frontend/src/lib/format.ts": "Provides currency and date formatting utilities, using stored user settings when available.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and the Internet Identity provider.",
  "frontend/src/pages/AccountDetailPage.tsx": "Displays a single account’s details and transactions with options to add new transactions.",
  "frontend/src/pages/AccountsPage.tsx": "Shows a list of accounts, total balance, and a dialog for creating new accounts.",
  "frontend/src/pages/BudgetsPage.tsx": "Manages monthly budgets, category limits, and spending calculations with editing support.",
  "frontend/src/pages/CategoriesPage.tsx": "Displays categories, date‑range totals, and a dialog to create new categories using finance query hooks.",
  "frontend/src/pages/DashboardPage.tsx": "Shows financial overview with charts and stats, fetching transactions, accounts, and categories by date range.",
  "frontend/src/pages/SettingsPage.tsx": "Manages user settings like currency, persisting them per‑identity in localStorage.",
  "frontend/src/pages/TransactionsPage.tsx": "Lists transactions with search and filters, and provides a dialog for creating new transactions.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading/storing URL parameters and syncing them with sessionStorage, including hash‑based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, animations, and layout utilities with custom theme variables and plugins.",
  "project_state.json": "Defines project metadata, existing features, modular architecture notes, and known build issues for a Firefly 3-like finance app."
}