{
  "backend/main.mo": "Motoko canister defining finance data models, authorization mixin, maps for user‑scoped records, and initial implementation of report creation with ID management.",
  "feature_evidence.json": "JSON report detailing implemented frontend features, affected files, components, and confidence metadata for reports‑related functionality.",
  "frontend-file-summaries.txt": "Pre‑generated summaries describing the purpose of various frontend React files and components throughout the project.",
  "frontend/index.css": "Tailwind CSS setup defining light/dark theme variables and global base styles for the frontend UI.",
  "frontend/index.html": "HTML entry point including favicon, metadata, root div, and script loading the React app.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router routes, including full reports CRUD routes, and wrapping content in AppShell and theme providers.",
  "frontend/src/components/auth/AuthGate.tsx": "Auth wrapper that loads the user profile, shows setup dialog when needed, and displays a spinner while loading.",
  "frontend/src/components/auth/LoginScreen.tsx": "Login page using Internet Identity with styled card UI, loading state, and error display.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog that collects and saves the user's name using a profile mutation.",
  "frontend/src/components/dashboard/CategoryBreakdownChart.tsx": "Computes expense totals by category and displays a color‑coded bar chart of spending distribution.",
  "frontend/src/components/dashboard/InvoicesCard.tsx": "Fetches invoices and shows counts for total, unpaid, overdue, and total paid value.",
  "frontend/src/components/dashboard/QuickStats.tsx": "Calculates total income, expenses, and net value from transactions and displays them in summary cards.",
  "frontend/src/components/dashboard/ReportsCard.tsx": "Shows last and most-used report types and provides a button to create a new report.",
  "frontend/src/components/dashboard/TopCategories.tsx": "Determines the top five expense categories and displays totals and percentages for each.",
  "frontend/src/components/layout/AppShell.tsx": "Layout wrapper providing navigation, header, user menu, and routing integration for the app.",
  "frontend/src/components/reports/ReportResultsView.tsx": "Runs financial report calculations for income vs expenses or category breakdown and renders result tables with loading and empty states.",
  "frontend/src/components/tags/TagChips.tsx": "Displays a limited number of tag badges with a counter for additional hidden tags.",
  "frontend/src/components/tags/TagMultiSelect.tsx": "Provides a popover-based multi-select UI for choosing tags and showing selected tags as removable badges.",
  "frontend/src/components/tags/TagsManagerCard.tsx": "Tag management card enabling creation, listing, and deletion of tags with validation and confirmation dialogs.",
  "frontend/src/components/transactions/BulkEditDialog.tsx": "Dialog for bulk editing or deleting multiple transactions with options to change fields or modify tags.",
  "frontend/src/components/transactions/CsvImportDialog.tsx": "Dialog for uploading, validating, and importing CSV transaction data with previews and error reporting.",
  "frontend/src/components/transactions/TransactionFormDialog.tsx": "Modal form for creating a new transaction with validation, tag selection, and API mutation handling.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useFinanceQueries.ts": "Provides React Query hooks for fetching and mutating finance data such as accounts, categories, transactions, budgets, and invoices.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, loading stored identities, and providing login/logout via a React context.",
  "frontend/src/hooks/useInvoicePermissions.ts": "Fetches the caller's role and derives invoice-related permissions based on user role.",
  "frontend/src/index.css": "Tailwind-based global styles defining light/dark theme variables and base layout rules.",
  "frontend/src/lib/format.ts": "Utility functions for formatting currency and dates, using stored user settings when available.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the app.",
  "frontend/src/pages/AccountDetailPage.tsx": "Displays a single account’s details and balance, and lists or creates transactions for that account.",
  "frontend/src/pages/AccountsPage.tsx": "Shows all accounts with total balance and provides a dialog to create new accounts.",
  "frontend/src/pages/BankConnectionsPage.tsx": "Manages bank connections including creation, deletion, syncing, and viewing connection status.",
  "frontend/src/pages/BudgetsPage.tsx": "Handles monthly budgets, category limits, spending calculations, and budget creation or updates.",
  "frontend/src/pages/CategoriesPage.tsx": "Displays categories with transaction totals over a date range and allows creating new categories.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard with date-range filtering that loads accounts, transactions, and categories and displays stats, charts, and onboarding UI when empty.",
  "frontend/src/pages/InvoiceDetailPage.tsx": "Fetches and displays a single invoice with permissions, actions for editing and PDF download, and fallback states for loading or missing invoices.",
  "frontend/src/pages/InvoiceFormPage.tsx": "Create/edit form for invoices with line items, validation, totals calculation, and submission via create/update mutations.",
  "frontend/src/pages/invoices/invoiceFilters.ts": "Defines invoice filter state and helpers for status labels, variants, and constructors.",
  "frontend/src/pages/invoices/invoiceMath.ts": "Utility functions to compute invoice line totals, subtotal, tax, and overall totals.",
  "frontend/src/pages/InvoicesPage.tsx": "Invoice list with search, status filtering, permission‑based actions, and delete confirmation.",
  "frontend/src/pages/ReportDetailPage.tsx": "Displays a report’s details with download and delete options, handling loading and missing-report states.",
  "frontend/src/pages/ReportFormPage.tsx": "Form page for creating and editing reports with date validation, filters, tag selection, and PDF download.",
  "frontend/src/pages/ReportsPage.tsx": "Lists reports with filtering, deletion, PDF export, and navigation to view or edit.",
  "frontend/src/pages/SettingsPage.tsx": "Settings UI allowing users to store preferences like currency and manage tags.",
  "frontend/src/pages/TransactionsPage.tsx": "Displays, filters, sorts, and manages transactions with bulk edit, CSV import/export, and tag support.",
  "frontend/src/types/invoice.ts": "Type definitions for invoices, items, statuses, and input payloads used across the frontend.",
  "frontend/src/utils/invoicePdf.ts": "Generates a printable HTML invoice and triggers a file download, formatting customer, item, and total data.",
  "frontend/src/utils/reportPdf.ts": "Generates a printable HTML view for a report and triggers the browser print dialog to save as PDF.",
  "frontend/src/utils/transactionsCsv.ts": "Parses CSV text/files into transaction rows and validates them against accounts, categories, and tags.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL parameters using query strings, hash, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and enabled plugins.",
  "project_state.json": "Metadata describing the project state, requirements, architecture notes, and existing implemented features."
}