{
  "backend/main.mo": "Motoko backend actor managing user profiles, accounts, categories, and transactions with per‑principal authorization and persistent state.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to source files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Collected one‑line summaries of all major frontend files for documentation and build planning.",
  "frontend/index.css": "Global Tailwind CSS theme using OKLCH variables for light and dark modes and shared UI tokens.",
  "frontend/index.html": "HTML entry point defining metadata, favicon, and mounting root for the React app.",
  "frontend/src/App.tsx": "Main app entry configuring routes, authentication gating, and theme provider before rendering routed pages.",
  "frontend/src/components/auth/AuthGate.tsx": "Auth wrapper that waits for user profile load and triggers profile setup dialog when missing.",
  "frontend/src/components/auth/LoginScreen.tsx": "Internet Identity login screen with sign‑in button, loading state, and error feedback.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog prompting first‑time users for a display name and saving the profile via backend mutation.",
  "frontend/src/components/dashboard/CategoryBreakdownChart.tsx": "Computes expense totals per category and renders a color‑coded bar breakdown with percentages. Shows a placeholder card when no expense data exists.",
  "frontend/src/components/dashboard/QuickStats.tsx": "Calculates total income, expenses, and net balance from transactions and displays them in three summary cards. Uses icons and conditional styling for positive or negative net.",
  "frontend/src/components/dashboard/TopCategories.tsx": "Aggregates expenses to find the top five categories and shows their totals and percentage of total spending. Displays a fallback card when no expenses are present.",
  "frontend/src/components/layout/AppShell.tsx": "Provides the main layout with navigation, header, and user menu, including sign‑out handling and active‑route styling. Wraps child pages inside a consistent app shell.",
  "frontend/src/components/transactions/TransactionFormDialog.tsx": "Modal form for creating transactions with validation, account/category selection, and automatic income/expense amount handling. Submits via a mutation and resets state on success.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on Internet Identity, initializing access control and refetching dependent queries when the actor changes. Exposes the current actor and fetch state.",
  "frontend/src/hooks/useFinanceQueries.ts": "Provides React Query hooks for fetching and mutating accounts, categories, transactions, and user profiles through the backend actor. Handles cache invalidation and actor‑dependent query enabling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements a React context and provider for Internet Identity authentication, handling login, stored identity loading, and auth-client setup. Exposes a hook returning identity state and login status helpers.",
  "frontend/src/index.css": "Defines Tailwind base styles and extensive CSS variables for light and dark themes. Applies global background, text, and border styling.",
  "frontend/src/lib/format.ts": "Provides currency and date formatting helpers, including user-specific currency lookup via localStorage. Falls back to USD if no stored preference exists.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and the InternetIdentityProvider. Imports global styles and renders the root component.",
  "frontend/src/pages/AccountDetailPage.tsx": "Renders account details, balance, and transaction list with loading and empty states. Supports adding transactions via a dialog.",
  "frontend/src/pages/AccountsPage.tsx": "Displays all accounts, total balance, and loading/empty states. Provides a dialog to create new accounts and navigation to account detail pages.",
  "frontend/src/pages/CategoriesPage.tsx": "Shows categories with transaction totals for selectable date ranges. Allows creating categories and computes category totals using fetched transactions.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard showing financial overview with date‑range filtering, stats, charts, and onboarding prompts when no data exists.",
  "frontend/src/pages/SettingsPage.tsx": "Settings screen allowing users to load and save per‑identity preferences, currently supporting default currency.",
  "frontend/src/pages/TransactionsPage.tsx": "Page listing all transactions with search and filtering plus a dialog to create new transactions.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, persisting, and clearing URL and session parameters, including hash‑based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, typography, animations, and plugin setup for the app.",
  "project_state.json": "Project metadata describing current features, requirements, images, and planned functionality for the finance app."
}