{
  "backend/main.mo": "Main Motoko actor managing user data, finance entities, and new bank connections with authorization and migration support.",
  "backend/migration.mo": "Migration module adding empty bank connection fields to existing actor state and initializing new IDs.",
  "feature_evidence.json": "Feature evidence report linking new bank connection and sync features to related frontend files and requirements.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend component, page, and utility file.",
  "frontend/index.css": "Tailwind-based global styling defining light/dark themes and color variables using OKLCH values.",
  "frontend/index.html": "HTML entry point defining page metadata, favicon, and React root mount point.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, authentication gating, theming, and integrates the Bank Connections page.",
  "frontend/src/components/auth/AuthGate.tsx": "Wrapper that loads the user profile and triggers the profile setup dialog before rendering children.",
  "frontend/src/components/auth/LoginScreen.tsx": "Internet Identity login page with styled sign-in button, loading state, and error display.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog that collects a user's name and saves it via a profile mutation.",
  "frontend/src/components/dashboard/CategoryBreakdownChart.tsx": "Computes expense totals by category and renders a color-coded bar breakdown chart.",
  "frontend/src/components/dashboard/QuickStats.tsx": "Calculates income, expenses, and net total and displays them in summary cards.",
  "frontend/src/components/dashboard/TopCategories.tsx": "Identifies top expense categories and shows their totals and percentages.",
  "frontend/src/components/layout/AppShell.tsx": "Main app layout with navigation, user avatar menu, and route-aware header.",
  "frontend/src/components/tags/TagChips.tsx": "Displays a compact list of tag badges with optional count overflow.",
  "frontend/src/components/tags/TagMultiSelect.tsx": "Popover-based multi-select UI for choosing and removing tags.",
  "frontend/src/components/tags/TagsManagerCard.tsx": "Tag management card allowing creation, listing, and deletion of tags.",
  "frontend/src/components/transactions/BulkEditDialog.tsx": "Dialog component for applying bulk edits or deletions to selected transactions, supporting account, category, date, and tag changes. Manages form state, validation, and async edit/delete operations.",
  "frontend/src/components/transactions/CsvImportDialog.tsx": "Dialog for uploading, parsing, validating, and importing CSV transaction data. Handles file selection, validation feedback, and submission to import transactions.",
  "frontend/src/components/transactions/TransactionFormDialog.tsx": "Dialog form for creating a single transaction with account, category, amount, date, and tags. Performs validation and submits data through a createTransaction mutation.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages an authenticated or anonymous backend actor and invalidates dependent queries when it changes. Integrates with Internet Identity and initializes access control.",
  "frontend/src/hooks/useFinanceQueries.ts": "Collection of React Query hooks for fetching and mutating finance-related data such as accounts, categories, transactions, budgets, and tags. Each hook interacts with the backend actor and manages cache invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling identity loading, login, logout, and status tracking. Wraps AuthClient setup and exposes identity state to the app.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive CSS variables for light and dark themes, applying global border and body styles.",
  "frontend/src/lib/format.ts": "Provides helpers to format currency and dates, using stored user settings to determine the active currency.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and the InternetIdentityProvider, importing global styles.",
  "frontend/src/pages/AccountDetailPage.tsx": "Displays details for a single account, showing balance, transactions, and a dialog to add new transactions.",
  "frontend/src/pages/AccountsPage.tsx": "Lists all accounts with total balance and provides a dialog-driven flow for creating new accounts.",
  "frontend/src/pages/BankConnectionsPage.tsx": "Manages bank connections with create, delete, and sync actions, including status badges and confirmation dialogs.",
  "frontend/src/pages/BudgetsPage.tsx": "Handles monthly budgets, category limits, and spending calculations with controls for navigating months.",
  "frontend/src/pages/CategoriesPage.tsx": "Displays categories with totals for a selected date range and includes a dialog to create new categories. Fetches categories and related transactions to compute totals.",
  "frontend/src/pages/DashboardPage.tsx": "Provides a financial overview with date‑range‑filtered stats, charts, and onboarding prompts. Fetches transactions, accounts, and categories to render dashboard components.",
  "frontend/src/pages/SettingsPage.tsx": "Manages user settings such as preferred currency, persisted in localStorage per identity. Also includes tag management via TagsManagerCard.",
  "frontend/src/pages/TransactionsPage.tsx": "Displays and filters transactions, supports searching, CSV import/export, and bulk actions. Integrates dialogs for creating, editing, and importing transactions.",
  "frontend/src/utils/transactionsCsv.ts": "Implements CSV parsing, line parsing, validation, and helpers for working with transaction CSV data. Validates rows against accounts, categories, and tags.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, persisting, and clearing URL parameters, including hash‑based routing support. Provides sessionStorage-backed param persistence.",
  "frontend/tailwind.config.js": "Tailwind configuration defining dark mode, content paths, extended theming with OKLCH colors, custom animations, and plugins.",
  "project_state.json": "Metadata describing project version, feature status, priorities, architectural notes, and known build issues."
}