{
  "kind": "build_request",
  "title": "Add Bank Connections UI and Sync Workflow for Auto-Importing Transactions",
  "projectName": "Firefly Lite",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-18",
      "text": "Add a new Bank Connections module that lets an authenticated user create, view, and remove bank connections, scoped to the current Internet Identity Principal.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Can you add the ability to auto download transaction history from banks with a user interface to do so?"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes canister APIs to create/list/delete bank connections and all data is scoped to the caller Principal (no cross-user access).",
        "Frontend provides a Bank Connections screen that lists existing connections and allows adding and removing a connection with clear success/error feedback in English."
      ]
    },
    {
      "id": "REQ-19",
      "text": "Implement a UI-driven transaction sync workflow for each bank connection, including a manual “Sync now” action and visible sync status (idle/in progress/last synced/last error).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "add the ability to auto download transaction history from banks with a user interface to do so"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a canister API to run a sync for a given connection and returns a structured result indicating how many transactions were created/ignored and any error message.",
        "Frontend shows per-connection sync controls and status, including a disabled state while syncing and a toast/message on completion or failure."
      ]
    },
    {
      "id": "REQ-20",
      "text": "Provide an initial built-in “Mock Bank” provider that simulates downloading transaction history and imports transactions into existing Accounts/Categories/Transactions so the full end-to-end bank sync UX can be tested without external bank APIs.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "auto download transaction history from banks"
        ]
      },
      "acceptanceCriteria": [
        "A user can create a connection of type “Mock Bank” from the UI and run “Sync now”.",
        "Syncing a “Mock Bank” connection creates new transactions visible in the existing Transactions page after sync completes.",
        "Repeated syncs do not create unbounded duplicates (e.g., the backend uses a stable external-id/cursor concept per connection to avoid re-importing the same mock transactions)."
      ]
    },
    {
      "id": "REQ-21",
      "text": "Add navigation and routing for the Bank Connections screen so it appears alongside the existing main sections (Dashboard, Accounts, Transactions, Categories, Budgets, Settings).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "with a user interface to do so"
        ]
      },
      "acceptanceCriteria": [
        "A new route exists for the Bank Connections screen and is accessible from the main navigation.",
        "The Bank Connections screen is only reachable when authenticated (consistent with the existing app auth gating)."
      ]
    },
    {
      "id": "REQ-22",
      "text": "Add React Query hooks to call the new Bank Connections backend APIs (list connections, create/delete, sync, and refresh relevant cached data after sync).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "auto download transaction history from banks with a user interface"
        ]
      },
      "acceptanceCriteria": [
        "Frontend has dedicated React Query hooks for bank connections and syncing, following the same pattern as existing finance hooks.",
        "After a successful sync, the Transactions (and Accounts, if affected) queries are invalidated/refetched so the UI reflects newly imported transactions without a manual refresh."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor with all logic in backend/main.mo; add backend/migration.mo changes only if stable state layout requires an upgrade-safe migration.",
    "Do not edit files under frontend/src/components/ui or any paths listed as immutable (compose existing UI components instead).",
    "Do not add third-party bank aggregation integrations (e.g., Plaid) unless the user provides the required provider, endpoints, and credentials; implement an internal mock provider to validate the auto-sync UX end-to-end."
  ],
  "nonGoals": [
    "Implementing real bank OAuth/Open Banking integrations for specific institutions without user-provided API details.",
    "Real-time/background syncing while the app is closed (no push notifications or background jobs beyond user-initiated sync in the UI)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}