{
  "kind": "build_request",
  "title": "Add Budgets module (monthly budgets, category limits, rollover)",
  "projectName": "Firefly Lite",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-7",
      "text": "Add a new Budgets data model to the Motoko backend, scoped per authenticated caller (Principal), supporting monthly budgets with per-category limits and rollover tracking between months.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-2"
        ],
        "quotes": [
          "Create this Budgets: monthly budgets, category limits, and rollover logic, first",
          "Yes"
        ]
      },
      "acceptanceCriteria": [
        "Backend defines a Budget entity keyed by a unique BudgetId and associated with (year, month) and CategoryId.",
        "Budgets are stored per-caller Principal, consistent with existing accounts/categories/transactions storage patterns.",
        "Budget limits support per-category monthly caps (one limit per category per month).",
        "Backend stores enough information to support rollover between months (e.g., computed or persisted carryover amount), and defines the rollover rule in code (carry remaining/overspend forward to next month).",
        "All budget methods trap/deny access when caller is not authorized as a user (consistent with existing AccessControl checks)."
      ]
    },
    {
      "id": "REQ-8",
      "text": "Implement backend canister APIs for Budgets CRUD and budget-month summary computation (spent, remaining, rollover/carryover) per category for a selected month.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Create this Budgets: monthly budgets, category limits, and rollover logic, first"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes methods to create/update/delete a budget limit for a given (year, month, categoryId).",
        "Backend exposes a query method to list all budget limits for a given (year, month).",
        "Backend exposes a query method that returns a per-category budget summary for a given (year, month), including: limit, spent (from transactions in that month), remaining, and carryover from previous month according to the rollover rule.",
        "Budget summary computation uses the existing transactions and categories data, and only counts spending for expense categories (Category.isExpense = true).",
        "If a category has no budget limit set for the month, it is either omitted from the summary or returned with a null/zero limit (choose one behavior and keep it consistent and documented via types)."
      ]
    },
    {
      "id": "REQ-9",
      "text": "If adding Budgets state changes the upgrade-stable layout, add/adjust backend/migration.mo so existing user data (profiles, accounts, categories, transactions) is preserved across canister upgrades while initializing the new Budgets state safely.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Create this Budgets: monthly budgets, category limits, and rollover logic, first"
        ]
      },
      "acceptanceCriteria": [
        "After an upgrade, previously created accounts, categories, transactions, and profiles remain accessible and unchanged.",
        "Budgets state initializes to an empty state for existing users if no budgets existed previously.",
        "No upgrade-time traps occur due to missing/extra fields in persisted state."
      ]
    },
    {
      "id": "REQ-10",
      "text": "Add React Query hooks in the frontend to call the new Budgets backend APIs (fetch monthly budgets, upsert/delete budget limits, fetch monthly budget summaries).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Create this Budgets: monthly budgets, category limits, and rollover logic, first"
        ]
      },
      "acceptanceCriteria": [
        "Frontend includes new hooks colocated with existing finance hooks (e.g., in frontend/src/hooks/useFinanceQueries.ts) for budgets queries and mutations.",
        "Hooks are disabled until the backend actor is available (consistent with existing hooks).",
        "On successful budget mutations, the relevant budget query keys are invalidated/refetched so UI updates immediately."
      ]
    },
    {
      "id": "REQ-11",
      "text": "Create a new Budgets screen that lets the user select a month, set per-category monthly limits, and view budget status (spent/remaining/carryover) for that month.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Create this Budgets: monthly budgets, category limits, and rollover logic, first"
        ]
      },
      "acceptanceCriteria": [
        "A new route exists for Budgets (e.g., /budgets) and is accessible from the main app navigation.",
        "Budgets page shows a month selector (at minimum: current month with ability to move to previous/next month).",
        "Budgets page lists categories and allows setting/editing a monthly limit per category (expense categories at minimum).",
        "Budgets page displays computed budget status per category for the selected month (limit, spent, remaining, and carryover).",
        "Empty states are handled (e.g., no categories yet, no budgets set yet) with clear English user-facing copy."
      ]
    },
    {
      "id": "REQ-12",
      "text": "Add Budgets to the main navigation so it appears alongside Dashboard, Accounts, Transactions, Categories, and Settings.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Create this Budgets: monthly budgets, category limits, and rollover logic, first"
        ]
      },
      "acceptanceCriteria": [
        "The AppShell navigation includes a 'Budgets' item that routes to the Budgets page.",
        "Active route styling works for the Budgets route similarly to existing nav items.",
        "All user-facing navigation text is in English."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko canister (all logic in backend/main.mo; add backend/migration.mo only if required for preserving state).",
    "Do not edit files under frontend/src/components/ui (compose existing shadcn components instead).",
    "Do not edit immutable frontend hook/bootstrap paths listed in SYSTEM_CONTEXT (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "No external databases or third-party services; persist budgets in-canister scoped by Principal, consistent with existing data."
  ],
  "nonGoals": [
    "Implement the other future modules (Goals, Recurring schedules, Alerts, Advanced reports, Net-worth, Bulk editing, Tags, CSV import/export, Shared accounts/household mode).",
    "Add notifications, real-time updates, or background scheduling/automation for budgets (this module is manual budgets + computed summaries only).",
    "Redesign the app’s overall visual theme (keep the existing theme and styling direction)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}