{
  "kind": "build_request",
  "title": "Firefly 3-like Personal Finance Tracker (Accounts, Transactions, Spending Overview)",
  "projectName": "Firefly Lite",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement Internet Identity sign-in and sign-out, and scope all finance data to the currently authenticated user (Principal).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "There is an app called Firefly 3. Can you make a similar app?"
        ]
      },
      "acceptanceCriteria": [
        "Unauthenticated users can access only a sign-in screen/CTA and cannot read/write finance data.",
        "Authenticated users see their own data only; data is isolated per Principal.",
        "A clear sign-out action is available in the app UI."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Create backend data models and canister APIs to manage personal finance data: accounts, categories, transactions, and summary queries.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "There is an app called Firefly 3. Can you make a similar app?"
        ]
      },
      "acceptanceCriteria": [
        "Accounts support: create, list, get, update, archive/unarchive, delete (only if no transactions reference it).",
        "Categories support: create, list, update, archive/unarchive, delete (only if unused).",
        "Transactions support: create, list (with paging), get, update, delete.",
        "Each transaction includes: date, amount, currency (as text), description, type (income/expense/transfer), fromAccount/toAccount as applicable, optional category, and optional notes.",
        "Summary queries exist for: totals by month, totals by category over a date range, and current balances per account.",
        "All APIs enforce ownership using caller Principal."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Build the core UI screens for a Firefly 3-like workflow: Dashboard (overview), Accounts, Transactions, Categories, and Settings.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "There is an app called Firefly 3. Can you make a similar app?"
        ]
      },
      "acceptanceCriteria": [
        "Navigation provides access to Dashboard, Accounts, Transactions, Categories, and Settings.",
        "Accounts screen shows account list with balances and an account detail view with transaction list for that account.",
        "Transactions screen supports list view with filters (date range, account, type, category) and search by description.",
        "Categories screen lists categories and shows spend totals for a chosen date range.",
        "Settings includes basic preferences UI (e.g., default currency text field) stored per user."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Implement transaction creation/editing UX that supports income, expense, and transfers, with validation and helpful defaults.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "There is an app called Firefly 3. Can you make a similar app?"
        ]
      },
      "acceptanceCriteria": [
        "A transaction form allows selecting type (income/expense/transfer).",
        "For expense: requires fromAccount, amount > 0, date; toAccount is not required.",
        "For income: requires toAccount, amount > 0, date; fromAccount is not required.",
        "For transfer: requires both fromAccount and toAccount (must be different), amount > 0, date.",
        "Form displays inline validation errors and prevents submit until valid.",
        "After save, the list and account balances update without a full page refresh."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Add a spending overview dashboard with charts and quick stats (current month income/expense, net, and top categories).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "There is an app called Firefly 3. Can you make a similar app?"
        ]
      },
      "acceptanceCriteria": [
        "Dashboard shows current month totals for income, expense, and net.",
        "Dashboard shows a breakdown chart by category for a selected date range (default: current month).",
        "Dashboard shows a small list of top spending categories (e.g., top 5) with amounts.",
        "If there is no data, the dashboard shows an empty state with a clear prompt to add an account/transaction."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Add initial visual design direction and apply it consistently across the app (layout, typography, spacing, and component styling). Choose a distinctive theme appropriate for a personal finance product without using a blue/purple primary palette.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "There is an app called Firefly 3. Can you make a similar app?"
        ]
      },
      "acceptanceCriteria": [
        "A coherent theme is applied across pages (e.g., warm neutral palette with green accents, consistent typography and card/table styles).",
        "Key UI elements (nav, tables, forms, empty states) look consistent and polished.",
        "Theme avoids blue/purple as the primary brand colors."
      ]
    }
  ],
  "constraints": [
    "Backend must be implemented as a single Motoko actor (single canister).",
    "Do not edit files under frontend immutable paths (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui); only compose/reuse them.",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Advanced Firefly 3 features such as rule-based automation, recurring transactions, bill reminders, attachments, multi-user sharing, and complex budgeting envelopes.",
    "Integration with external banks or importing via third-party services.",
    "Real-time updates via WebSockets or push notifications."
  ],
  "imageRequirements": {
    "required": [
      "Minimal finance app icon with a firefly-inspired abstract mark (app-icon.dim_512x512.png)",
      "Subtle dashboard header illustration with warm neutral tones and green accents (dashboard-hero.dim_1600x400.png)"
    ],
    "edits": []
  }
}