{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Firefly Lite — Bank Connections UI and Manual Sync Workflow",
  "requirements": [
    {
      "id": "REQ-18",
      "summary": "Add a Bank Connections screen to create, list, and remove bank connections for the authenticated user.",
      "acceptanceCriteria": [
        "Frontend provides a Bank Connections screen that lists existing connections and allows adding and removing a connection with clear success/error feedback in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/BankConnectionsPage.tsx",
          "operation": "create",
          "description": "Create the Bank Connections screen UI that lists connections, provides an add-connection form (name + provider/type), and supports removing a connection with clear English success/error feedback using existing shadcn-ui components (do not edit ui components). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useFinanceQueries.ts",
          "operation": "modify",
          "description": "Add React Query query/mutation hooks for bank connections list/create/delete that call the backend actor methods and provide consistent loading/error states with existing finance hooks. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-19",
      "summary": "Add per-connection manual sync controls and visible sync status (idle/in progress/last synced/last error), including disabled state while syncing and completion/failure messages.",
      "acceptanceCriteria": [
        "Frontend shows per-connection sync controls and status, including a disabled state while syncing and a toast/message on completion or failure."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/BankConnectionsPage.tsx",
          "operation": "modify",
          "description": "Implement per-connection 'Sync now' UI and status rendering (idle/in progress/last synced/last error). Disable sync controls while syncing, show a toast/message on completion or failure (e.g., via sonner), and optionally refresh the list after sync to reflect updated status. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useFinanceQueries.ts",
          "operation": "modify",
          "description": "Add a React Query mutation hook for syncing a bank connection. Ensure mutation handles in-flight state and exposes success/error callbacks suitable for toast feedback. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-20",
      "summary": "Expose the built-in “Mock Bank” provider option in the UI so users can create a mock connection and run sync to see imported transactions appear.",
      "acceptanceCriteria": [
        "A user can create a connection of type “Mock Bank” from the UI and run “Sync now”.",
        "Syncing a “Mock Bank” connection creates new transactions visible in the existing Transactions page after sync completes."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/BankConnectionsPage.tsx",
          "operation": "modify",
          "description": "Include “Mock Bank” as a selectable provider/type when creating a new connection, and ensure the UI guides the user to run 'Sync now' afterward. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useFinanceQueries.ts",
          "operation": "modify",
          "description": "After a successful sync mutation, invalidate/refetch cached finance queries so newly imported transactions appear in the existing Transactions page without manual refresh (at minimum invalidate ['transactions'] and ['accounts'] where applicable). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-21",
      "summary": "Add routing and navigation entry for the Bank Connections screen alongside existing main sections, reachable only when authenticated.",
      "acceptanceCriteria": [
        "A new route exists for the Bank Connections screen and is accessible from the main navigation.",
        "The Bank Connections screen is only reachable when authenticated (consistent with the existing app auth gating)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register a new TanStack Router route for the Bank Connections page (e.g., '/bank-connections') and include it in the route tree so it is navigable when authenticated (leveraging existing app-wide auth gating). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/layout/AppShell.tsx",
          "operation": "modify",
          "description": "Add a 'Bank Connections' item to the main navigation alongside Dashboard/Accounts/Transactions/Categories/Budgets/Settings, using existing button/link styling and icons. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-22",
      "summary": "Add dedicated React Query hooks for bank connection APIs (list/create/delete/sync) and refresh relevant cached data after sync.",
      "acceptanceCriteria": [
        "Frontend has dedicated React Query hooks for bank connections and syncing, following the same pattern as existing finance hooks.",
        "After a successful sync, the Transactions (and Accounts, if affected) queries are invalidated/refetched so the UI reflects newly imported transactions without a manual refresh."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useFinanceQueries.ts",
          "operation": "modify",
          "description": "Implement dedicated hooks: useGetBankConnections, useCreateBankConnection, useDeleteBankConnection, and useSyncBankConnection, mirroring the patterns used by existing hooks (actor dependency gating + query invalidation). Ensure sync triggers invalidation/refetch of transactions (and accounts, if affected) and bank connections status. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/BankConnectionsPage.tsx",
          "operation": "modify",
          "description": "Wire the Bank Connections screen to the new hooks, ensuring cached data updates after create/delete/sync and the UI stays consistent (loading states, disabled actions, and English error messages). Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}