{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Firefly Lite — Budgets module (frontend hooks + Budgets screen + navigation)",
  "requirements": [
    {
      "id": "REQ-10",
      "summary": "Add React Query hooks for Budgets queries and mutations via the backend actor.",
      "acceptanceCriteria": [
        "Frontend includes new hooks colocated with existing finance hooks (e.g., in frontend/src/hooks/useFinanceQueries.ts) for budgets queries and mutations.",
        "Hooks are disabled until the backend actor is available (consistent with existing hooks).",
        "On successful budget mutations, the relevant budget query keys are invalidated/refetched so UI updates immediately."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useFinanceQueries.ts",
          "operation": "modify",
          "description": "Add budgets-focused React Query hooks alongside existing finance hooks: fetch budgets for a selected month (and/or all budgets), fetch the selected month’s budget summary, and mutations to create/update/delete (and a convenience upsert pattern) with proper actor-availability gating and query invalidation for budgets and budget-summary query keys."
        }
      ]
    },
    {
      "id": "REQ-11",
      "summary": "Create a Budgets screen with month navigation, per-category limit editing, and budget status display for the selected month.",
      "acceptanceCriteria": [
        "A new route exists for Budgets (e.g., /budgets) and is accessible from the main app navigation.",
        "Budgets page shows a month selector (at minimum: current month with ability to move to previous/next month).",
        "Budgets page lists categories and allows setting/editing a monthly limit per category (expense categories at minimum).",
        "Budgets page displays computed budget status per category for the selected month (limit, spent, remaining, and carryover).",
        "Empty states are handled (e.g., no categories yet, no budgets set yet) with clear English user-facing copy."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/BudgetsPage.tsx",
          "operation": "create",
          "description": "Create the Budgets page UI using composed shadcn/ui building blocks (e.g., Card, Button, Table, Input, Select) to provide: previous/next month navigation; an expense-category list with editable monthly limit inputs; and a per-category status section (limit, spent, remaining, carryover) powered by the new budget hooks (and existing categories/transactions hooks as needed for display). Include clear loading and empty-state copy when there are no categories and/or no budgets set yet. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register the new /budgets route in the TanStack Router route tree and wire it to BudgetsPage so it is navigable within the authenticated app shell."
        }
      ]
    },
    {
      "id": "REQ-12",
      "summary": "Add Budgets to the main AppShell navigation with correct routing and active-state styling.",
      "acceptanceCriteria": [
        "The AppShell navigation includes a 'Budgets' item that routes to the Budgets page.",
        "Active route styling works for the Budgets route similarly to existing nav items.",
        "All user-facing navigation text is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/AppShell.tsx",
          "operation": "modify",
          "description": "Add a new 'Budgets' navigation item (with an appropriate icon) pointing to /budgets in the existing navItems list, ensuring active-route styling behavior matches the other items and label text remains in English."
        }
      ]
    }
  ]
}