{
  "kind": "spec_vs_diff_report",
  "version": "1.0",
  "generatedAt": "2026-02-17T03:08:05.439Z",
  "summary": "Budgets route/page and navigation were added on the frontend, and backend state/migration scaffolding for budgets was introduced. However, the diff summary does not provide evidence of the required backend Budgets CRUD/summary APIs, nor the required frontend React Query hooks for budget summaries and budget limit CRUD keyed by (year, month, categoryId). The Budgets page appears to compute spending/carryover client-side from transactions rather than calling a backend budget summary API.",
  "missing_requirements": [
    {
      "id": "REQ-8",
      "requirement": "Implement backend canister APIs for Budgets CRUD and budget-month summary computation (spent, remaining, rollover/carryover) per category for a selected month.",
      "reason": "The diff shows only added budget types/state in backend/main.mo and a migration; it does not show any shared/query methods for: upsert/delete budget limit by (year, month, categoryId), listing limits for a month, or a query returning per-category budget summaries with spent/remaining/carryover and expense-category-only filtering.",
      "evidence": [
        "backend/main.mo",
        "backend/migration.mo"
      ]
    },
    {
      "id": "REQ-7",
      "requirement": "Add a new Budgets data model to the Motoko backend, scoped per authenticated caller (Principal), supporting monthly budgets with per-category limits and rollover tracking between months.",
      "reason": "While budget types and a per-Principal budgets map are present, the diff summary does not show evidence that budget methods exist and enforce AccessControl checks, nor does it show the rollover rule implemented in backend code (the model includes carryOver but no demonstrated rule/logic).",
      "evidence": [
        "backend/main.mo"
      ]
    },
    {
      "id": "REQ-10",
      "requirement": "Add React Query hooks in the frontend to call the new Budgets backend APIs (fetch monthly budgets, upsert/delete budget limits, fetch monthly budget summaries).",
      "reason": "useFinanceQueries.ts is truncated before any budgets hooks are shown. BudgetsPage imports useGetBudgets/useUpsertBudget but there is no evidence of a hook for fetching budget summaries (REQ explicitly requires this), nor clear evidence that mutations invalidate the relevant budget query keys.",
      "evidence": [
        "frontend/src/hooks/useFinanceQueries.ts",
        "frontend/src/pages/BudgetsPage.tsx"
      ]
    },
    {
      "id": "REQ-11",
      "requirement": "Create a new Budgets screen that lets the user select a month, set per-category monthly limits, and view budget status (spent/remaining/carryover) for that month.",
      "reason": "A Budgets page exists with month navigation and limit editing, but the diff summary does not show it using the backend-provided computed budget summary API (REQ-8) to display per-category limit/spent/remaining/carryover; instead, the page computes spending/carryover from transactions client-side in the shown snippet. The snippet is truncated before confirming it displays remaining/carryover consistently per category and handles the required empty states with clear copy.",
      "evidence": [
        "frontend/src/pages/BudgetsPage.tsx"
      ]
    }
  ],
  "hallucinated_features": [
    {
      "description": "Client-side budget summary/carryover computation using transactions and previous-month totals instead of calling a backend budget summary query.",
      "reason": "The BuildRequest requires a backend budget summary computation API and corresponding frontend hooks. The Budgets page code shown calculates category spending and carryover locally from transactions/budgets arrays.",
      "evidence": [
        "frontend/src/pages/BudgetsPage.tsx"
      ]
    }
  ],
  "confidence": 0.64,
  "changed_files": [
    "backend/main.mo",
    "backend/migration.mo",
    "frontend-file-summaries.txt",
    "frontend/src/App.tsx",
    "frontend/src/components/layout/AppShell.tsx",
    "frontend/src/hooks/useFinanceQueries.ts",
    "frontend/src/pages/BudgetsPage.tsx",
    "project_state.json"
  ]
}